import { User, Code, Book, Mail } from "lucide-react"
import { AboutItem } from "@/types/index"

export const aboutData: AboutItem[] = [
  {
    icon: User,
    text: "مرحباً، أنا [اسمك]، مطور ويب متخصص في تصميم وتطوير التطبيقات الحديثة باستخدام أحدث التقنيات.",
  },
  {
    icon: Code,
    text: "لدي خبرة واسعة في مجال تطوير الويب باستخدام تقنيات مثل Next.js وReact وTypeScript بالإضافة إلى Tailwind CSS لتصميم واجهات مستخدم متجاوبة وجذابة.",
  },
  {
    icon: Book,
    text: "أؤمن بأهمية التعلم المستمر ومتابعة أحدث التطورات في مجال التكنولوجيا، وأسعى دائماً لتحسين مهاراتي لتحقيق أفضل تجربة للمستخدمين.",
  },
  {
    icon: Mail,
    text: "في هذا الموقع ستجد نبذة عن مشاريعي وأعمالي ومهاراتي التقنية، كما يمكنك التواصل معي لمناقشة أفكار التعاون أو الاستفسارات.",
  },
]
